import { ArticleType } from '../ArticleType';

export const mockArticle: ArticleType = {
  updatedAt: '2025-11-19T06:07:42.299Z',
  createdAt: '2025-11-19T06:07:42.299Z',
  likeCount: 0,
  writer: {
    image: '',
    name: '홍길동',
    id: 1,
  },
  image: '',
  title: '게시글 제목입니다.게시글 제목입',
  id: 1,
  isLiked: true,
  content:
    '게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.게시글 내용입니다.',
};
